<?php

return [
    'admins'    => [
        'create'    => [
            'form'  => [
                'confirm_password'  => 'تاكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'info'              => 'البيانات',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'كلمة المرور',
                'roles'             => 'الادوار',
            ],
            'title' => 'اضافة المدراء',
        ],
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            'name'          => 'الاسم',
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'المدراء',
        ],
        'update'    => [
            'form'  => [
                'confirm_password'  => 'تآكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'تغير كلمة المرور',
                'roles'             => 'الادوار',
            ],
            'title' => 'تعديل المدراء',
        ],
        'validation'=> [
            'email'     => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'    => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'      => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'  => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
            'roles'     => [
                'required'  => 'من فضلك اختر ادوار المدير',
            ],
        ],
    ],
    'users'     => [
        'create'    => [
            'form'  => [
                'confirm_password'  => 'تاكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'info'              => 'البيانات',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'كلمة المرور',
            ],
            'title' => 'اضافة المرضى',
        ],
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            'name'          => 'الاسم',
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'المرضى',
        ],
        'update'    => [
            'form'  => [
                'confirm_password'  => 'تآكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'تغير كلمة المرور',
            ],
            'title' => 'تعديل المريض',
        ],
        'validation'=> [
            'email'     => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'    => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'      => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'  => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
        ],
    ],
    'profile'     => [
        'update' => 'تحديث الملف الشخصي',
    ],
    'settings'     => 'الإعدادات',
];
